kAMDSuccess = "Não ocorreu nenhum erro.";
kAMDUndefinedError = "Ocorreu um erro desconhecido.";
kAMDBadHeaderError = "Não foi possível transferir o ficheiro.";
kAMDNoResourcesError = "Não foi possível alocar recurso.";
kAMDReadError = "Não foi possível ler o dispositivo.";
kAMDWriteError = "Não foi possível escrever no dispositivo.";
kAMDUnknownPacketError = "O pacote é desconhecido.";
kAMDInvalidArgumentError = "O argumento não é válido.";
kAMDNotFoundError = "Não foi possível encontrar o ficheiro.";
kAMDIsDirectoryError = "O caminho é um directório.";
kAMDPermissionError = "Não tem autorização.";
kAMDNotConnectedError = "Não existe ligação ao dispositivo.";
kAMDTimeOutError = "A aplicação excedeu o tempo limite.";
kAMDOverrunError = "A capacidade do buffer foi ultrapassada.  ";
kAMDEOFError = "Fim de ficheiro.";
kAMDUnsupportedError = "Esta operação não é suportada.";
kAMDFileExistsError = "O ficheiro já existe.";
kAMDBusyError = "O dispositivo está ocupado.";
kAMDCryptoError = "Não foi possível estabelecer uma ligação segura ao dispositivo.";
kAMDTooBigError = "A mensagem é demasiado grande.";
kAMDInvalidResponseError = "Foi recebida uma resposta inesperada do dispositivo.";
kAMDMissingKeyError = "Falta a chave.";
kAMDMissingValueError = "Falta o valor.";
kAMDGetProhibitedError = "Não é possível obter o valor de um dispositivo bloqueado por código.";
kAMDSetProhibitedError = "Não é possível definir o valor no dispositivo. ";
kAMDRemoveProhibitedError = "Não é possível remover o valor no dispositivo.";
kAMDImmutableValueError = "Não é possível alterar o valor.";
kAMDPasswordProtectedError = "O dispositivo está protegido por palavra-passe.";
kAMDMissingHostIDError = "O dispositivo não reconhece este host.";
kAMDInvalidHostIDError = "O dispositivo não reconhece este host.";
kAMDSessionActiveError = "A sessão está activa.";
kAMDSessionInactiveError = "A sessão não está activa.";
kAMDMissingSessionIDError = "Falta o ID da sessão.";
kAMDInvalidSessionIDError = "O ID da sessão não é válido.";
kAMDMissingServiceError = "Falta o serviço.";
kAMDInvalidServiceError = "O serviço não é válido.";
kAMDServiceLimitError = "Estão já a ser executados demasiados exemplos deste serviço.";
kAMDCheckinSetupFailedError = "Não foi possível iniciar o serviço no dispositivo.";
kAMDInvalidCheckinError = "Não foi possível iniciar o serviço no dispositivo.";
kAMDCheckinTimeoutError = "O serviço não foi iniciado correctamente no dispositivo.";
kAMDCheckinConnectionFailedError = "O serviço não foi iniciado correctamente no dispositivo.";
kAMDCheckinReceiveFailedError = "O serviço não foi iniciado correctamente no dispositivo.";
kAMDCheckinResponseFailedError = "O serviço não foi iniciado correctamente no dispositivo.";
kAMDCheckinOutOfMemoryError = "O serviço não foi iniciado correctamente no dispositivo.";
kAMDCheckinSendFailedError = "O serviço não foi iniciado correctamente no dispositivo.";
kAMDMissingPairRecordError = "O host não está emparelhado com o dispositivo.";
kAMDInvalidPairRecordError = "O host já não está emparelhado com o dispositivo.";
kAMDSavePairRecordFailedError = "Não foi possível guardar o registo de emparelhamento.";
kAMDInvalidActivationRecordError = "O registo de activação não é válido.";
kAMDMissingActivationRecordError = "Não foi possível encontrar o registo de activação.";
kAMDServiceProhibitedError = "Não foi possível iniciar o serviço no dispositivo.";
kAMDEscrowLockedError = "O dispositivo só está disponível depois de reiniciar e desbloquear.";
kAMDProhibitedBySupervision = "Operação não autorizada em dispositivos supervisados.";
kAMDPairingProhibitedError = "O emparelhamento só é permitido por USB.";
kAMDWrongDroidError = "O dispositivo encontra-se em modo de recuperação.";
kAMDSUVerificationError = "Não foi possível verificar o pacote de actualização de software.";
kAMDSUPatchError = "Não foi possível aplicar correcção ao ficheiro.";
kAMDSUFirmwareError = "Não foi possível alterar o firmware.";
kAMDProvisioningProfileNotValid = "O perfil de fornecimento não é válido.";
kAMDSendMessageError = "Não foi possível enviar mensagem ao dispositivo.";
kAMDReceiveMessageError = "Não foi possível receber mensagem do dispositivo.";
kAMDMissingOptionsError = "Faltam as opções.";
kAMDMissingImageTypeError = "Falta a imagem.";
kAMDDigestFailedError = "Não foi possível ler a imagem do disco.";
kAMDStartServiceError = "Não foi possível iniciar o serviço.";
kAMDInvalidDiskImageError = "A imagem do disco não é válida.";
kAMDMissingDigestError = "Falta o resumo.";
kAMDMuxError = "Ocorreu im erro com o multiplexador USB.";
kAMDApplicationAlreadyInstalledError = "Já está instalada no dispositivo uma aplicação do sistema com o identificador do bundle indicado, e não pode ser substituída.";
kAMDApplicationMoveFailedError = "Não foi possível mover a aplicação para o dispositivo.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Não foi possível proteger a aplicação com uma sandbox.";
kAMDApplicationVerificationFailedError = "Não foi possível verificar a aplicação.";
kAMDArchiveDestructionFailedError = "Não foi possível remover o arquivo da aplicação.";
kAMDBundleVerificationFailedError = "Não foi possível verificar o bundle da operadora.";
kAMDCarrierBundleCopyFailedError = "Não foi possível instalar o bundle da operador.";
kAMDCarrierBundleDirectoryCreationFailedError = "Não foi possível criar directório de bundle de operadora.";
kAMDCarrierBundleMissingSupportedSIMsError = "Não há SIMs suportados para este bundle de operadora.";
kAMDCommCenterNotificationFailedError = "Não foi possível procurar notificação da baseband.";
kAMDContainerCreationFailedError = "Não foi possível criar contentor de aplicação.";
kAMDContainerP0wnFailedError = "Não foi possível reparar as permissões do contentor da aplicação.";
kAMDContainerRemovalFailedError = "Não foi possível remover o contentor da aplicação.";
kAMDEmbeddedProfileInstallFailedError = "Não foi possível instalar o perfil de fornecimento integrado.";
kAMDErrorError = "Ocorreu um erro.";
kAMDExecutableTwiddleFailedError = "Não foi possível alterar as permissões de execução da aplicação.";
kAMDExistenceCheckFailedError = "Não foi possível verificar se a aplicação já existe ou não.";
kAMDInstallMapUpdateFailedError = "Não foi possível actualizar a lista de aplicações instaladas.";
kAMDManifestCaptureFailedError = "Não foi possível guardar o manifesto da aplicação.";
kAMDMapGenerationFailedError = "Não foi possível gerar lista de aplicações.";
kAMDMissingBundleExecutableError = "O bundle da aplicação não contém um executável.";
kAMDMissingBundleIdentifierError = "O bundle da aplicação não contém um identificador válido.";
kAMDMissingBundlePathError = "Não foi possível determinar o caminho do bundle da aplicação.";
kAMDMissingContainerError = "Não foi possível encontrar o contentor da aplicação instalada.";
kAMDNotificationFailedError = "Não foi possível publicar uma notificação.";
kAMDPackageExtractionFailedError = "Não foi possível abrir o pacote da aplicação.";
kAMDPackageInspectionFailedError = "Não foi possível inspeccionar o pacote da aplicação.";
kAMDPackageMoveFailedError = "Não foi possível mover o pacote para a localização temporária.";
kAMDPathConversionFailedError = "Não foi possível converter o caminho.";
kAMDRestoreContainerFailedError = "Não foi possível restaurar o contentor da aplicação.";
kAMDSeatbeltProfileRemovalFailedError = "Não foi possível remover o perfil do seatbelt da aplicação.";
kAMDStageCreationFailedError = "Não foi possível criar directório temporário.";
kAMDSymlinkFailedError = "Não foi possível criar symlink.";
kAMDiTunesArtworkCaptureFailedError = "Não foi possível guardar o grafismo do iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Não foi possível guardar os metadados do iTunes.";
kAMDAlreadyArchivedError = "A aplicação já foi arquivada.";
kAMDUnknownCommandError = "O dispositivo não reconhece o comando.";
kAMDAPIInternalError = "Ocorreu um erro interno de API.";
kAMDMuxCreateListenerError = "Não foi possível procurar dispositivos USB.";
kAMDMuxGetListenerError = "Não foi possível comunicar com o detector de USB.";
kAMDMuxConnectError = "Não foi possível estabelecer ligação com o dispositivo.";
kAMDDeviceTooNewError = "É necessário actualizar a aplicação.";
kAMDDeviceRefNoGood = "Este dispositivo já não está ligado.";
kAMDDeviceDisconnectedError = "Este dispositivo já não está ligado.";
kAMDCannotTranslateError = "Não foi possível traduzir as mensagens do dispositivo.";
kAMDMobileImageMounterMissingImageSignature = "Programação não suportada.";
kAMDMobileImageMounterResponseCreationFailed = "Programação não suportada.";
kAMDMobileImageMounterMissingImageType = "Programação não suportada.";
kAMDMobileImageMounterMissingImagePath = "Programação não suportada.";
kAMDMobileImageMounterImageMapLoadFailed = "Programação não suportada.";
kAMDMobileImageMounterAlreadyMounted = "Programação não suportada.";
kAMDMobileImageMounterImageMoveFailed = "Programação não suportada.";
kAMDMobileImageMounterMountPathMissing = "Programação não suportada.";
kAMDMobileImageMounterMountPathNotEmpty = "Programação não suportada.";
kAMDMobileImageMounterImageMountFailed = "Programação não suportada.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Programação não suportada.";
kAMDMobileImageMounterDigestFailed = "Programação não suportada.";
kAMDMobileImageMounterDigestCreationFailed = "Programação não suportada.";
kAMDMobileImageMounterImageVerificationFailed = "Programação não suportada.";
kAMDMobileImageMounterImageInfoCreationFailed = "Programação não suportada.";
kAMDMobileImageMounterImageMapStoreFailed = "Programação não suportada.";
kAMDDeviceOSVersionTooLow = "A versão do sistema operativo do dispositivo é demasiado antiga.";
kAMDNoWifiSyncSupportError = "O dispositivo não suporta sincronização sem fios.";
kAMDDeviceFamilyNotSupported = "Esta aplicação não suporta este tipo de dispositivo.";
kAMDPackagePatchFailedError = "Não foi possível aplicar correcção à aplicação.";
kAMDIncorrectArchitectureError = "Esta aplicação não suporta o tipo de CPU deste dispositivo.";
kAMDPluginCopyFailedError = "Não foi possível copiar plug‑in VPN para o contentor da aplicação.";
kAMDBreadcrumbFailedError = "Não foi possível escrever caminho para a instalação.";
kAMDBreadcrumbUnlockError = "Não foi possível actualizar caminho para a instalação.";
kAMDGeoJSONCaptureFailedError = "Não foi possível guardar dados GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Não foi possível guardar o grafismo do Quiosque.";
kAMDMissingCommandError = "O pedido não tem nenhum comando.";
kAMDNotEntitledError = "A aplicação não tem permissão para fazer este pedido.";
kAMDMissingPackagePathError = "O pedido não tem o caminho do pacote.";
kAMDMissingContainerPathError = "O pedido não tem o caminho do contentor.";
kAMDMissingApplicationIdentifierError = "O pedido não tem o identificador de aplicação.";
kAMDMissingAttributeValueError = "O pedido não tem um valor necessário.";
kAMDLookupFailedError = "Não foi possível listar aplicações instaladas.";
kAMDDictCreationFailedError = "Não foi possível extrair capacidades do pedido.";

/* kMISFileError */
"A file operation failed." = "Uma operação de ficheiros falhou.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Um recurso assinado foi adicionado, modificado ou apagado.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Não foi encontrado nenhum perfil de fornecimento para este executável.";

/* kMISUnknownError */
"An unknown error has occurred." = "Ocorreu um erro desconhecido.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Tentou modificar um perfil de fornecimento imutável.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "A aplicação não dispõe de uma assinatura válida.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "A assinatura da aplicação é válida, mas não é igual ao hash esperado.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "O executável contém uma assinatura que não é válida.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "O executável foi assinado com direitos que não são válidos.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "A identidade usada para assinar o executável deixou de ser válida.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "A assinatura não era válida.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Ocorreu um erro ao comunicar com o periférico.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Este perfil de fornecimento não pode ser instalado neste dispositivo.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "A assinatura deste perfil de fornecimento não é válida (ou é válida, mas não é fiável).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Este perfil de fornecimento está caducado.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Este perfil de fornecimento é mal formado.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Este perfil de fornecimento não é suportado.";

/* kMISAllocationError */
"Unable to allocate memory." = "Não é possível atribuir memória.";

